In [1]:
import numpy as np
import pandas as pd

In [3]:
dict= {'col_1': [1, 2, 3, np.nan],
 'col_2': [4, np.nan, 6, 7],
 'col_3': ['a', 'b', 'c', None]
}

In [4]:
df = pd.DataFrame(dict)
df

   col_1  col_2 col_3
0    1.0    4.0     a
1    2.0    NaN     b
2    3.0    6.0     c
3    NaN    7.0  None

### Manejo de valores nulos con pandas

In [5]:
df.isnull()

   col_1  col_2  col_3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [6]:
df.isnull() * 1

   col_1  col_2  col_3
0      0      0      0
1      0      1      0
2      0      0      0
3      1      0      1

In [7]:
df.fillna('Missing')    # sustituye los Nan con el mensaje 'Missing'

     col_1    col_2    col_3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

In [8]:
df.fillna(df.mean())    # sustituye los Nan con la media de los valores

/tmp/ipykernel_300/2587993583.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())    # sustituye los Nan con la media de los valores

   col_1     col_2 col_3
0    1.0  4.000000     a
1    2.0  5.666667     b
2    3.0  6.000000     c
3    2.0  7.000000  None

In [9]:
df.interpolate()    # a los valores str no afecta, pero a los Nan los asume tipo siguiendo un patron o serie

   col_1  col_2 col_3
0    1.0    4.0     a
1    2.0    5.0     b
2    3.0    6.0     c
3    3.0    7.0  None

In [10]:
df.dropna()    # cuando los datos vienen con pocas inconsistencias, elimina valores nulos

   col_1  col_2 col_3
0    1.0    4.0     a
2    3.0    6.0     c